luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
				<register derivedFrom="ADDR">
					<name>ADDR1</name>
					<displayName>ADDR1</displayName>
					<addressOffset>0x1c</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR2</name>
					<displayName>ADDR2</displayName>
					<addressOffset>0x20</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR3</name>
					<displayName>ADDR3</displayName>
					<addressOffset>0x24</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR4</name>
					<displayName>ADDR4</displayName>
					<addressOffset>0x28</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR5</name>
					<displayName>ADDR5</displayName>
					<addressOffset>0x2c</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR6</name>
					<displayName>ADDR6</displayName>
					<addressOffset>0x30</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR7</name>
					<displayName>ADDR7</displayName>
					<addressOffset>0x34</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR8</name>
					<displayName>ADDR8</displayName>
					<addressOffset>0x38</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR9</name>
					<displayName>ADDR9</displayName>
					<addressOffset>0x3c</addressOffset>
				</register>
				<register derivedFrom="ADDR">
					<name>ADDR10</name>
					<displayName>ADDR10</displayName>
					<addressOffset>0x40</addressOffset>
				</register>
				<register>
					<name>ADSTA_EXT</name>
					<displayName>ADSTA_EXT</displayName>
					<description>Extended State Register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JBUSY</name>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JEOSIF</name>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>JEOCIF</name>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>JEOSMPIF</name>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>EOCIF</name>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>EOSMPIF</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHANY0</name>
					<displayName>CHANY0</displayName>
					<description>Any Channel Selection Register 0</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHANYSEL7</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL6</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL5</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL4</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL3</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL2</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL1</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHANY1</name>
					<displayName>CHANY1</displayName>
					<description>Any Channel Selection Register 1</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHANYSEL15</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL14</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL13</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL12</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL11</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL10</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL9</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYSEL8</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANY_CFG</name>
					<displayName>ANY_CFG</displayName>
					<description>Any Channel Configuration Register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHANYNUM</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANY_CR</name>
					<displayName>ANY_CR</displayName>
					<description>Any Channel Control Register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JTRGEDGE</name>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JTRGSHIFT</name>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JTRGSEL</name>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JTRGEN</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JADST</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JAUTO</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JEOSIE</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JEOCIE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JEOSMPIE</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JCEN</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANYMDEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SMPR1</name>
					<displayName>SMPR1</displayName>
					<description>Sample Configuration Register 1</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAMP7</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP6</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP5</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP4</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP3</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP2</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP1</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SMPR2</name>
					<displayName>SMPR2</displayName>
					<description>Sample Configuration Register 2</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAMP10</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP9</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMP8</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JOFR</name>
					<displayName>JOFR</displayName>
					<description>Injected Channel Data Offset Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JOFFSET</name>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register derivedFrom="JOFR">
					<name>JOFR1</name>
					<displayName>JOFR1</displayName>
					<addressOffset>0x80</addressOffset>
				</register>
				<register derivedFrom="JOFR">
					<name>JOFR2</name>
					<displayName>JOFR2</displayName>
					<addressOffset>0x84</addressOffset>
				</register>
				<register derivedFrom="JOFR">
					<name>JOFR3</name>
					<displayName>JOFR3</displayName>
					<addressOffset>0x88</addressOffset>
				</register>
				<register>
					<name>JSQR</name>
					<displayName>JSQR</displayName>
					<description>Injected Sequence Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JNUM</name>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JSQ3</name>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JSQ2</name>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JSQ1</name>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>JSQ0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JADDATA</name>
					<displayName>JADDATA</displayName>
					<description>Injected Data Register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JVAILD</name>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JOVERRUN</name>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JCHANNELSEL</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JDATA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JDR</name>
					<displayName>JDR</displayName>
					<description>Injected Channel Data Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JVALID</name>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JOVERRUN</name>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>JDATA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
