luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
				<register derivedFrom="JDR">
					<name>JDR1</name>
					<displayName>JDR1</displayName>
					<addressOffset>0xb4</addressOffset>
				</register>
				<register derivedFrom="JDR">
					<name>JDR2</name>
					<displayName>JDR2</displayName>
					<addressOffset>0xb8</addressOffset>
				</register>
				<register derivedFrom="JDR">
					<name>JDR3</name>
					<displayName>JDR3</displayName>
					<addressOffset>0xbc</addressOffset>
				</register>
				<register>
					<name>LDATA</name>
					<displayName>LDATA</displayName>
					<description>Last Conversion Data Register</description>
					<addressOffset>0xF0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LVAILD</name>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOVERRUN</name>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LCHANNELSEL</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDATA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGSUPR</name>
					<displayName>TRGSUPR</displayName>
					<description>External Rule Trigger Event Suppression Register</description>
					<addressOffset>0xF4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRGSUPEN</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGSUPCNT</name>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP</name>
			<groupName>COMP</groupName>
			<baseAddress>0x40013C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CSR1</name>
					<displayName>CSR</displayName>
					<description>COMP x (x=1, 2) control and status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OUT</name>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTANASEL</name>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WE</name>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WSEL</name>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFLT</name>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HYST</name>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POL</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTSEL</name>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPSEL</name>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMSEL</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register derivedFrom="CSR1">
					<name>CSR2</name>
					<displayName>CSR2</displayName>
					<addressOffset>0x8</addressOffset>
				</register>
				<register>
					<name>CRV</name>
					<displayName>CRV</displayName>
					<description>COMP external reference voltage register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000</resetValue>
					<fields>
						<field>
							<name>CRVEN</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRVSRC</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRVSEL</name>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>POLL1</name>
					<displayName>POLL</displayName>
					<description>COMP x (x=1, 2) polling register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000</resetValue>
					<fields>
						<field>
							<name>POUT</name>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERIOD</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIXN</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POLLCH</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POLLEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register derivedFrom="POLL1">
					<name>POLL2</name>
					<displayName>POLL2</displayName>
					<addressOffset>0xc</addressOffset>
				</register>
