luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>COMP1_2</name>
				<description>Comparator 1/2 output connected to EXTI19 and EXTI20</description>
				<value>25</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>DBGMCU</name>
			<groupName>DBGMCU</groupName>
			<baseAddress>0x40013400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>DBG ID encode register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x4C513000</resetValue>
					<fields>
						<field>
							<name>DEVID</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>DBG control register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBGTIM6STOP</name>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM13STOP</name>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM14STOP</name>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM2PWMOFF</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM1PWMOFF</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM2STOP</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGTIM1STOP</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGIWDGSTOP</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGSLEEP</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DMA</name>
			<groupName>DMA</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>DMA interrupt status register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TEIF2</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF2</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF2</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF2</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEIF1</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HTIF1</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIF1</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIF1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFCR</name>
					<displayName>IFCR</displayName>
					<description>DMA interrupt flag clear register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CTEIF2</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CHTIF2</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CTCIF2</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CGIF2</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CTEIF1</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CHTIF1</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CTCIF1</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CGIF1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<cluster>
					<dim>2</dim>
					<dimIncrement>20</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>DMACH%s</name>
					<addressOffset>0x08</addressOffset>
					<register>
						<name>CCR</name>
						<displayName>CCR</displayName>
						<description>DMA channel x configuration register</description>
						<addressOffset>0x00</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ARE</name>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>MEM2MEM</name>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>PL</name>
								<bitOffset>12</bitOffset>
								<bitWidth>2</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>MSIZE</name>
								<bitOffset>10</bitOffset>
								<bitWidth>2</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>PSIZE</name>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>MINC</name>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>PINC</name>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>CIRC</name>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>DIR</name>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>TEIE</name>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>HTIE</name>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>TCIE</name>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
							<field>
								<name>EN</name>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CNDTR</name>
						<displayName>CNDTR</displayName>
						<description>DMA channel x number of data register</description>
						<addressOffset>0x04</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>NDT</name>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CPAR</name>
						<displayName>CPAR</displayName>
						<description>DMA channel x peripheral address register</description>
						<addressOffset>0x8</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>PA</name>
								<bitOffset>0</bitOffset>
								<bitWidth>32</bitWidth>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CMAR</name>
						<displayName>CMAR</displayName>
						<description>DMA channel x memory address register</description>
						<addressOffset>0xc</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>MA</name>
								<bitOffset>0</bitOffset>
								<bitWidth>32</bitWidth>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
