luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>DMA1_CH1</name>
				<description>DMA1 channel 1 global interrupt</description>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH3_CH2</name>
				<description>DMA1 channel [3:2] global interrupt</description>
				<value>10</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>EXTI</name>
			<groupName>EXTI</groupName>
			<baseAddress>0x40010400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>Interrupt mask register </description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IMRX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<displayName>EMR</displayName>
					<description>Event mask register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EMRX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTSR</name>
					<displayName>RTSR</displayName>
					<description>Rising edge trigger selection register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FTSR</name>
					<displayName>FTSR</displayName>
					<description>Falling edge trigger selection register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TRX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWIER</name>
					<displayName>SWIER</displayName>
					<description>Software interrupt event register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWIERX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Pending register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PRX</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
					</fields>
				</register>
			</registers>
			<interrupt>
				<name>EXTI0_1</name>
				<description>EXTI line [1:0] interrupt</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EXTI3_2</name>
				<description>EXTI line [3:2] interrupt</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EXTI15_4</name>
				<description>EXTI line [15:4] interrupt</description>
				<value>7</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>FLASH</name>
			<groupName>FLASH</groupName>
			<baseAddress>0x40022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ACR</name>
					<displayName>ACR</displayName>
					<description>Flash access control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000038</resetValue>
					<fields>
						<field>
							<name>PRFTBS</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRFTBE</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LATENCY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR</name>
					<displayName>KEYR</displayName>
					<description>FPEC key register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FKEYR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTKEYR</name>
					<displayName>OPTKEYR</displayName>
					<description>Flash OPTKEY register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OPTKEYR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Flash status register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EOP</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPRTERR</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PGERR</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BSY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Flash control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>OPTWRE</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STRT</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPTER</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPTPG</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MER</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PER</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PG</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AR</name>
					<displayName>AR</displayName>
					<description>Flash address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FAR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OBR</name>
					<displayName>OBR</displayName>
					<description>Option byte register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x03FFFC1C</resetValue>
					<fields>
						<field>
							<name>DATA1</name>
							<bitOffset>18</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DATA0</name>
							<bitOffset>10</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NBOOT1</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NRSTSTDBY</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NRSTSTOP</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WDGSW</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDPRT</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPTERR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRPR</name>
					<displayName>WRPR</displayName>
					<description>Write protection register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>WRP</name>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
