luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>FLASH</name>
				<description>Flash global interrupt</description>
				<value>3</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>GPIOA</name>
			<groupName>GPIO</groupName>
			<baseAddress>0x48000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CRL</name>
					<displayName>CRL</displayName>
					<description>Port configuration register low</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x44444444</resetValue>
					<fields>
						<field>
							<name>CNF7</name>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE7</name>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF6</name>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE6</name>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF5</name>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE5</name>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF4</name>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE4</name>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF3</name>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE3</name>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF2</name>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE2</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF1</name>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE1</name>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF0</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CRH</name>
					<displayName>CRH</displayName>
					<description>Port configuration register high</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x44444444</resetValue>
					<fields>
						<field>
							<name>CNF15</name>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE15</name>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF14</name>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE14</name>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF13</name>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE13</name>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF12</name>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE12</name>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF11</name>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE11</name>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF10</name>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE10</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF9</name>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE9</name>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNF8</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE8</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>Port input data register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IDRY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ODR</name>
					<displayName>ODR</displayName>
					<description>Port output data register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ODRY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BSRR</name>
					<displayName>BSRR</displayName>
					<description>Port bit set/reset register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BRY</name>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BSY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>Port bit reset register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BRY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCKR</name>
					<displayName>LCKR</displayName>
					<description>Port configuration lock register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LCKK</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCKY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<displayName>DCR</displayName>
					<description>Port output open drain control register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PX15</name>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX14</name>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX13</name>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX12</name>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX11</name>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX10</name>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX9</name>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX8</name>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX7</name>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX6</name>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX5</name>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX4</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX3</name>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX2</name>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX1</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PX0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFRL</name>
					<displayName>AFRL</displayName>
					<description>Port alternate function register low</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>AFR7</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR6</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR5</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR4</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR3</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR2</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR1</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFRH</name>
					<displayName>AFRH</displayName>
					<description>Port alternate function register high</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFR15</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR14</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR13</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR12</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR11</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR10</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR9</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFR8</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
