luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIOA">
			<name>GPIOB</name>
			<baseAddress>0x48000400</baseAddress>
		</peripheral>
		<peripheral>
			<name>HWDIV</name>
			<groupName>HWDIV</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DVDR</name>
					<displayName>DVDR</displayName>
					<description>Dividend register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIVIDEND</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DVSR</name>
					<displayName>DVSR</displayName>
					<description>Divisor register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>DIVISOR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>QUOTR</name>
					<displayName>QUOTR</displayName>
					<description>Quotient register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>QUOTIENT</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMDR</name>
					<displayName>RMDR</displayName>
					<description>Remainder register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REMAINDER</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVF</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>OVFE</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USIGN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
			<interrupt>
				<name>HWDIV</name>
				<description>Hard_Divider interrupt</description>
				<value>8</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>IWDG</name>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KR</name>
					<displayName>KR</displayName>
					<description>Key register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEY</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Prescaler register </description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RLR</name>
					<displayName>RLR</displayName>
					<description>Reload register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>RL</name>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UPDATE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IVU</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RVU</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PVU</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQCLR</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IRQSEL</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IGEN</name>
					<displayName>IGEN</displayName>
					<description>Interrupt generate register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>IGEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>Counter register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>IWDGCNT</name>
							<bitOffset>8</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IWDGPS</name>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
