luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>IWDG</name>
				<description>independent watchdog interrupt connected to EXTI24</description>
				<value>0</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>OPAMP1</name>
			<groupName>OPAMP</groupName>
			<baseAddress>0x40009000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000002</resetValue>
					<fields>
						<field>
							<name>OPAEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="OPAMP1">
			<name>OPAMP2</name>
			<baseAddress>0x40009400</baseAddress>
		</peripheral>
		<peripheral>
			<name>PWR</name>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Power control register </description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000600</resetValue>
					<fields>
						<field>
							<name>PLS</name>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PVDE</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Power control status register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PVDO</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Power configuration register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000160</resetValue>
					<fields>
						<field>
							<name>LSICAL</name>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSICALSEL</name>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMCR</name>
					<displayName>MEMCR</displayName>
					<description>Power memory control register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>FDPEN</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FWUPEN</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MEMLOCK</name>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RCC</name>
			<groupName>RCC</groupName>
			<baseAddress>0x40021000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>RCC control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>HSIRDY</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSION</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>RCC configuration register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000A0</resetValue>
					<fields>
						<field>
							<name>MCO</name>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPRE1</name>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRE</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWS</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SW</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIR</name>
					<displayName>CIR</displayName>
					<description>RCC clock interrupt register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSIRDYC</name>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>LSIRDYC</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>HSIRDYIE</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSIRDYIE</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSIRDYF</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSIRDYF</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBRSTR</name>
					<displayName>AHBRSTR</displayName>
					<description>RCC AHB peripheral reset register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HWDIV</name>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIOB</name>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIOA</name>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APB1RSTR</name>
					<displayName>APB1RSTR</displayName>
					<description>RCC APB1 peripheral reset register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSCFG</name>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBG</name>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWR</name>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPA2</name>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPA1</name>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP</name>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USART1</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC1</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM14</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM13</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM6</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM2</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBENR</name>
					<displayName>AHBENR</displayName>
					<description>RCC AHB peripheral clock enable register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000014</resetValue>
					<fields>
						<field>
							<name>HWDIV</name>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIOB</name>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIOA</name>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FLASH</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRAM</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APB1ENR</name>
					<displayName>APB1ENR</displayName>
					<description>RCC APB1 peripheral clock enable register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x88000000</resetValue>
					<fields>
						<field>
							<name>EXTI</name>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYSCFG</name>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBG</name>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWR</name>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWDG</name>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPA2</name>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPA1</name>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP</name>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USART1</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC1</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM14</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM13</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM6</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM2</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>RCC control status register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x08000000</resetValue>
					<fields>
						<field>
							<name>LPWRRSTF</name>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IWDGRSTF</name>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SFTRSTF</name>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORRSTF</name>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINRSTF</name>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RMVF</name>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
						</field>
						<field>
							<name>LOCKUPF</name>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PVDRSTF</name>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCKUPEN</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PVDRSTEN</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSIRDY</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSION</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
