luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>Prescaler </description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<displayName>ARR</displayName>
					<description>Auto Reload Register </description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCR</name>
					<displayName>RCR</displayName>
					<description>Repeat Count Register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>REPCNT</name>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REP</name>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<displayName>CCR1</displayName>
					<description>Compare Register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR2</name>
					<displayName>CCR2</displayName>
					<description>Compare Register 2</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR2</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR3</name>
					<displayName>CCR3</displayName>
					<description>Compare Register 3</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR3</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR4</name>
					<displayName>CCR4</displayName>
					<description>Compare Register 4</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR4</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BDTR</name>
					<displayName>BDTR</displayName>
					<description>Break And Dead-Time Register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DOE</name>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOE</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AOE</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BKP</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BKE</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSSR</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSSI</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCK</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTG</name>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<displayName>DCR</displayName>
					<description>DMA Control Register (only suitable for the chip with built in DMA)</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DBL</name>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAR</name>
					<displayName>DMAR</displayName>
					<description>DMA Address Register Of Continuous Mode (only suitable for the chip with built in DMA)</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMAB</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR3</name>
					<displayName>CCMR3</displayName>
					<description>Compare Mode Register 3</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OC5PE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR5</name>
					<displayName>CCR5</displayName>
					<description>Compare Register 5</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR5</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDER</name>
					<displayName>PDER</displayName>
					<description>PWM Phase Shift/DMA Repeat Update Request Enable Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR5SHIFTEN</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCR4SHIFTEN</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCR3SHIFTEN</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCR2SHIFTEN</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCR1SHIFTEN</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCDREPE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCRxFALL</name>
					<displayName>CCRxFALL</displayName>
					<description>PWM Phase Shift Count Down Compare Register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCRXFALL</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register derivedFrom="CCRxFALL">
					<name>CCRxFALL1</name>
					<displayName>CCRxFALL1</displayName>
					<addressOffset>0x64</addressOffset>
				</register>
				<register derivedFrom="CCRxFALL">
					<name>CCRxFALL2</name>
					<displayName>CCRxFALL2</displayName>
					<addressOffset>0x68</addressOffset>
				</register>
				<register derivedFrom="CCRxFALL">
					<name>CCRxFALL3</name>
					<displayName>CCRxFALL3</displayName>
					<addressOffset>0x6c</addressOffset>
				</register>
				<register derivedFrom="CCRxFALL">
					<name>CCRxFALL4</name>
					<displayName>CCRxFALL4</displayName>
					<addressOffset>0x70</addressOffset>
				</register>
				<register>
					<name>BKINF</name>
					<displayName>BKINF</displayName>
					<description>Break Input Filter Register</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMPBKINSEL</name>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IOBKINSEL</name>
							<bitOffset>6</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BKINF</name>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BKINFE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
