luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>TIM1_BRK_UP_TRG_COM</name>
				<description>TIM1 break, update, trigger, COM interrupt</description>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>TIM1_CC</name>
				<description>TIM1 capture compare interrupt</description>
				<value>14</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>TIM13</name>
			<groupName>TIM</groupName>
			<baseAddress>0x40001800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>Control Register 1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CKD</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ARPE</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPM</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>URS</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UDIS</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<displayName>DIER</displayName>
					<description>DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1DE</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UDE</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IE</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UIE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1OF</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC1IF</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>UIF</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<displayName>EGR</displayName>
					<description>Event Generation Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1G</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UG</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_OUTPUT</name>
					<displayName>CCMR1_OUTPUT</displayName>
					<description>Capture/Compare Mode Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OC1M</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1PE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_INPUT</name>
					<displayName>CCMR1_INPUT</displayName>
					<description>Capture/Compare Mode Register 1</description>
					<alternateRegister>CCMR1_OUTPUT</alternateRegister>
					<alternateRegister>CCMR1_OUTPUT</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IC1F</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1PSC</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCER</name>
					<displayName>CCER</displayName>
					<description>Capture/Compare Enable Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1NP</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1P</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1E</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>Counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>Prescaler </description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<displayName>ARR</displayName>
					<description>Auto Reload Register </description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<displayName>CCR1</displayName>
					<description>Capture/Compare Register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCR1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BDTR</name>
					<displayName>BDTR</displayName>
					<description>Break And Dead-Time Register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>MOE</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
