luozhibohouson/RM7200B_USART_DMA_Polling/MDK-ARM/.pack/MindMotion/MM32SPIN0230_DFP.1.1.2/SVD/MM32SPIN0230.svd
			</registers>
			<interrupt>
				<name>TIM13</name>
				<description>TIM13 global interrupt</description>
				<value>21</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="TIM13">
			<name>TIM14</name>
			<baseAddress>0x40014000</baseAddress>
			<interrupt>
				<name>TIM14</name>
				<description>TIM14 global interrupt</description>
				<value>22</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>TIM2</name>
			<groupName>TIM</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>Control Register 1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CKD</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ARPE</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMS</name>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPM</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>URS</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UDIS</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<displayName>CR2</displayName>
					<description>Control Register 2</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TI1S</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MMS</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCDS</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SMCR</name>
					<displayName>SMCR</displayName>
					<description>Slave Mode Control Register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ETP</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECE</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETPS</name>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETF</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSM</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TS</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCCS</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SMS</name>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<displayName>DIER</displayName>
					<description>DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TDE</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4DE</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3DE</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2DE</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1DE</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UDE</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4IE</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3IE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2IE</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1IE</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UIE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC4OF</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC3OF</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC2OF</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC1OF</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>TIF</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC4IF</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC3IF</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC2IF</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>CC1IF</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field>
							<name>UIF</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<displayName>EGR</displayName>
					<description>Event Generation Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TG</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC4G</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3G</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2G</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1G</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UG</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_OUTPUT</name>
					<displayName>CCMR1_OUTPUT</displayName>
					<description>Capture/Compare Mode Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OC2CE</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2M</name>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2PE</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC2FE</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1CE</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1M</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1PE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC1FE</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_INPUT</name>
					<displayName>CCMR1_INPUT</displayName>
					<description>Capture/Compare Mode Register 1</description>
					<alternateRegister>CCMR1_OUTPUT</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IC2F</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC2PSC</name>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2S</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1F</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC1PSC</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR2_OUTPUT</name>
					<displayName>CCMR2_OUTPUT</displayName>
					<description>Capture/Compare Mode Register 2</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OC4CE</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4M</name>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4PE</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC4FE</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4S</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3CE</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3M</name>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3PE</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OC3FE</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR2_INPUT</name>
					<displayName>CCMR2_INPUT</displayName>
					<description>Capture/Compare Mode Register 2</description>
					<alternateRegister>CCMR2_OUTPUT</alternateRegister>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IC4F</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC4PSC</name>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4S</name>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3F</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IC3PSC</name>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3S</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCER</name>
					<displayName>CCER</displayName>
					<description>Capture/Compare Enable Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC4NP</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4P</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC4E</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3NP</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3P</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3E</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2NP</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2P</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2E</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1NP</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1P</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1E</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>Counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>Prescaler </description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<displayName>ARR</displayName>
					<description>Auto Reload Register </description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<displayName>CCR1</displayName>
					<description>Capture/Compare Register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCR1</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR2</name>
					<displayName>CCR2</displayName>
					<description>Capture/Compare Register 2</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCR2</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR3</name>
					<displayName>CCR3</displayName>
					<description>Capture/Compare Register 3</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCR3</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR4</name>
					<displayName>CCR4</displayName>
					<description>Capture/Compare Register 4</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCR4</name>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<displayName>DCR</displayName>
					<description>DMA Control Register (only suitable for the chip with built in DMA)</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DBL</name>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBA</name>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAR</name>
					<displayName>DMAR</displayName>
					<description>DMA Address Register Of Continuous Mode (only suitable for the chip with built in DMA)</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMAB</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OR</name>
					<displayName>OR</displayName>
					<description>Input Option Register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TI4RMP</name>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETRRMP</name>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
